app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Game.find(params[:id])

INSERT INTO "games" ("player_1_id", "player_2_id", "board_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["player_1_id", 1], ["player_2_id", 2], ["board_id", 2], ["status", "winner"], ["created_at", "2015-12-24 01:02:24.069805"], ["updated_at", "2015-12-24 01:02:24.069805"]]
---
  def create
    game = Game.new(game_params)

    if game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "games" SET "player_2_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_2_id", 2], ["updated_at", "2015-12-23 00:36:27.269060"], ["id", 1]]
---
  def update
    game = Game.find(params[:id])

    if game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    Game.find(params[:id]).destroy

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "games" SET "status" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["status", "winner"], ["updated_at", "2015-12-23 00:40:23.651174"], ["id", 1]]
---
 def make_move
    user_id = User.authenticate(params[:username], params[:password])
    return render json: { errors: 'not authenticated' }, status: 403 if user_id.nil?
    game = Game.find(params[:id])
    return render json: { errors: 'not a participant' }, status: 403 unless game.has_user(user_id)
    return render json: { errors: 'game already over' }, status: 422 if [:winner, :tie].include?(game.status)
    return render json: { errors: 'not your turn' }, status: 422 unless game.next_player() == user_id
    return render json: { errors: 'move and location are required' }, status: 422 unless move_and_location?
    game.play(params[:move].to_s, params[:location].to_s)
    if game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
---
  def status #function to check if a user has won the game
    game = Game.find(params[:id])