app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with User.find(params[:id])

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "johndoe"], ["password", "foobarbaz"], ["created_at", "2015-12-21 19:17:09.766346"], ["updated_at", "2015-12-21 19:17:09.766346"]]
---
  def create
    user = User.new(user_params)
    if user.save